## Concat and Append

In [1]:
import numpy as np
import pandas as pd

In [3]:
print("concatenation of numpy array")
x=[[1,2],
   [3,4]]
np.concatenate([x,x],axis=1)

concatenation of numpy array

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [9]:
ser1=pd.Series(['A','B','C'])
ser2=pd.Series(['D','E','F'])
pd.concat([ser1,ser2],ignore_index=True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [10]:
#higher dimentional object : DataFrame

In [22]:
def make_df(col,ind):
    # Quickly make a DataFrame
    data={c:[str(c) + str(i) for i in ind]
                             for c in col}
    print(data)
    return pd.DataFrame(data,ind)

In [23]:
make_df('ABC',range(3))

{'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2'], 'C': ['C0', 'C1', 'C2']}

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [24]:
df1=make_df('AB',[1,2])
df2=make_df('AB',[3,4])
print(df1)
print(df2)
pd.concat([df1,df2])

{'A': ['A1', 'A2'], 'B': ['B1', 'B2']}
{'A': ['A3', 'A4'], 'B': ['B3', 'B4']}
    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [28]:
df3=make_df('ABC',[1,2])
df4=make_df('BCD',[3,4])
pd.concat([df3,df4])

{'A': ['A1', 'A2'], 'B': ['B1', 'B2'], 'C': ['C1', 'C2']}
{'B': ['B3', 'B4'], 'C': ['C3', 'C4'], 'D': ['D3', 'D4']}

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [29]:
pd.concat([df3,df4],join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [30]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## Merge and Join

In [33]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']}) 
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [34]:
df3=pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014